package com.kruchinin_Vadim.javacore.chapter4.logicalOperations;

// описание логических операций
public class ListLogical {
    /*
    & - Логическая операция И
    | - Логическая операция ИЛИ
    ^ - Логическая операция исключающее ИЛИ
    || - Укороченная логическая операция ИЛИ
    && - Укороченная логическая операция И
    ! - Логическая унарная операция НЕ
    &= - Логическая операция И с присваиванием
    |= - Логическая операция ИЛИ с присваиванием
    ^= - Логическая операция исключающее ИЛИ с присваиванием
    == - Равенство
    != - Неравенство
    ?: - Тернарная условная операция - если ..., то ..., иначе ...
     */
}
